# ####################################################################

#  Created by Genus(TM) Synthesis Solution 22.12-s082_1 on Wed Feb 19 11:28:27 -03 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design mips

create_clock -name "clk" -period 5.0 -waveform {0.0 2.5} [get_ports clk]
set_load -pin_load -min 0.0014 [get_ports i_rd]
set_load -pin_load -max 0.32 [get_ports i_rd]
set_load -pin_load -min 0.0014 [get_ports d_rd]
set_load -pin_load -max 0.32 [get_ports d_rd]
set_load -pin_load -min 0.0014 [get_ports d_wr]
set_load -pin_load -max 0.32 [get_ports d_wr]
set_load -pin_load -min 0.0014 [get_ports {d_addr[7]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[7]}]
set_load -pin_load -min 0.0014 [get_ports {d_addr[6]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[6]}]
set_load -pin_load -min 0.0014 [get_ports {d_addr[5]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[5]}]
set_load -pin_load -min 0.0014 [get_ports {d_addr[4]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[4]}]
set_load -pin_load -min 0.0014 [get_ports {d_addr[3]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[3]}]
set_load -pin_load -min 0.0014 [get_ports {d_addr[2]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[2]}]
set_load -pin_load -min 0.0014 [get_ports {d_addr[1]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[1]}]
set_load -pin_load -min 0.0014 [get_ports {d_addr[0]}]
set_load -pin_load -max 0.32 [get_ports {d_addr[0]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[15]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[15]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[14]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[14]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[13]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[13]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[12]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[12]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[11]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[11]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[10]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[10]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[9]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[9]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[8]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[8]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[7]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[7]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[6]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[6]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[5]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[5]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[4]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[4]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[3]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[3]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[2]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[2]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[1]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[1]}]
set_load -pin_load -min 0.0014 [get_ports {i_addr[0]}]
set_load -pin_load -max 0.32 [get_ports {i_addr[0]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[15]}]
set_load -pin_load -max 0.32 [get_ports {w_data[15]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[14]}]
set_load -pin_load -max 0.32 [get_ports {w_data[14]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[13]}]
set_load -pin_load -max 0.32 [get_ports {w_data[13]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[12]}]
set_load -pin_load -max 0.32 [get_ports {w_data[12]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[11]}]
set_load -pin_load -max 0.32 [get_ports {w_data[11]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[10]}]
set_load -pin_load -max 0.32 [get_ports {w_data[10]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[9]}]
set_load -pin_load -max 0.32 [get_ports {w_data[9]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[8]}]
set_load -pin_load -max 0.32 [get_ports {w_data[8]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[7]}]
set_load -pin_load -max 0.32 [get_ports {w_data[7]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[6]}]
set_load -pin_load -max 0.32 [get_ports {w_data[6]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[5]}]
set_load -pin_load -max 0.32 [get_ports {w_data[5]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[4]}]
set_load -pin_load -max 0.32 [get_ports {w_data[4]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[3]}]
set_load -pin_load -max 0.32 [get_ports {w_data[3]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[2]}]
set_load -pin_load -max 0.32 [get_ports {w_data[2]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[1]}]
set_load -pin_load -max 0.32 [get_ports {w_data[1]}]
set_load -pin_load -min 0.0014 [get_ports {w_data[0]}]
set_load -pin_load -max 0.32 [get_ports {w_data[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {i_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {r_data[0]}]
set_input_transition -min 0.003 [get_ports clk]
set_input_transition -max 0.16 [get_ports clk]
set_input_transition -min 0.003 [get_ports rst]
set_input_transition -max 0.16 [get_ports rst]
set_input_transition -min 0.003 [get_ports {i_data[15]}]
set_input_transition -max 0.16 [get_ports {i_data[15]}]
set_input_transition -min 0.003 [get_ports {i_data[14]}]
set_input_transition -max 0.16 [get_ports {i_data[14]}]
set_input_transition -min 0.003 [get_ports {i_data[13]}]
set_input_transition -max 0.16 [get_ports {i_data[13]}]
set_input_transition -min 0.003 [get_ports {i_data[12]}]
set_input_transition -max 0.16 [get_ports {i_data[12]}]
set_input_transition -min 0.003 [get_ports {i_data[11]}]
set_input_transition -max 0.16 [get_ports {i_data[11]}]
set_input_transition -min 0.003 [get_ports {i_data[10]}]
set_input_transition -max 0.16 [get_ports {i_data[10]}]
set_input_transition -min 0.003 [get_ports {i_data[9]}]
set_input_transition -max 0.16 [get_ports {i_data[9]}]
set_input_transition -min 0.003 [get_ports {i_data[8]}]
set_input_transition -max 0.16 [get_ports {i_data[8]}]
set_input_transition -min 0.003 [get_ports {i_data[7]}]
set_input_transition -max 0.16 [get_ports {i_data[7]}]
set_input_transition -min 0.003 [get_ports {i_data[6]}]
set_input_transition -max 0.16 [get_ports {i_data[6]}]
set_input_transition -min 0.003 [get_ports {i_data[5]}]
set_input_transition -max 0.16 [get_ports {i_data[5]}]
set_input_transition -min 0.003 [get_ports {i_data[4]}]
set_input_transition -max 0.16 [get_ports {i_data[4]}]
set_input_transition -min 0.003 [get_ports {i_data[3]}]
set_input_transition -max 0.16 [get_ports {i_data[3]}]
set_input_transition -min 0.003 [get_ports {i_data[2]}]
set_input_transition -max 0.16 [get_ports {i_data[2]}]
set_input_transition -min 0.003 [get_ports {i_data[1]}]
set_input_transition -max 0.16 [get_ports {i_data[1]}]
set_input_transition -min 0.003 [get_ports {i_data[0]}]
set_input_transition -max 0.16 [get_ports {i_data[0]}]
set_input_transition -min 0.003 [get_ports {r_data[15]}]
set_input_transition -max 0.16 [get_ports {r_data[15]}]
set_input_transition -min 0.003 [get_ports {r_data[14]}]
set_input_transition -max 0.16 [get_ports {r_data[14]}]
set_input_transition -min 0.003 [get_ports {r_data[13]}]
set_input_transition -max 0.16 [get_ports {r_data[13]}]
set_input_transition -min 0.003 [get_ports {r_data[12]}]
set_input_transition -max 0.16 [get_ports {r_data[12]}]
set_input_transition -min 0.003 [get_ports {r_data[11]}]
set_input_transition -max 0.16 [get_ports {r_data[11]}]
set_input_transition -min 0.003 [get_ports {r_data[10]}]
set_input_transition -max 0.16 [get_ports {r_data[10]}]
set_input_transition -min 0.003 [get_ports {r_data[9]}]
set_input_transition -max 0.16 [get_ports {r_data[9]}]
set_input_transition -min 0.003 [get_ports {r_data[8]}]
set_input_transition -max 0.16 [get_ports {r_data[8]}]
set_input_transition -min 0.003 [get_ports {r_data[7]}]
set_input_transition -max 0.16 [get_ports {r_data[7]}]
set_input_transition -min 0.003 [get_ports {r_data[6]}]
set_input_transition -max 0.16 [get_ports {r_data[6]}]
set_input_transition -min 0.003 [get_ports {r_data[5]}]
set_input_transition -max 0.16 [get_ports {r_data[5]}]
set_input_transition -min 0.003 [get_ports {r_data[4]}]
set_input_transition -max 0.16 [get_ports {r_data[4]}]
set_input_transition -min 0.003 [get_ports {r_data[3]}]
set_input_transition -max 0.16 [get_ports {r_data[3]}]
set_input_transition -min 0.003 [get_ports {r_data[2]}]
set_input_transition -max 0.16 [get_ports {r_data[2]}]
set_input_transition -min 0.003 [get_ports {r_data[1]}]
set_input_transition -max 0.16 [get_ports {r_data[1]}]
set_input_transition -min 0.003 [get_ports {r_data[0]}]
set_input_transition -max 0.16 [get_ports {r_data[0]}]
set_wire_load_mode "segmented"
